DataProcessors/DMS_OrdersAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>DMS_OrdersAPI</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ДопРеквизитыЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ДопРеквизитыЗаказаПоставщику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SITE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказаРено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказаРено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказНаряда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыданПодменныйАвтомобиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодменныйАвтомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиПодменногоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Renault_VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗаказаSappr</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SAPPR_ВидЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьВRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/DMS_OrdersAPI/Ext/ObjectModule.bsl
#Область ТехническиеФункции

Function StructureToJSON(Структура)

    Writer = New ЗаписьJSON;
    Writer.УстановитьСтроку(New ПараметрыЗаписиJSON(, Символы.Таб));

    ЗаписатьJSON(Writer, Структура);

    Return Writer.Закрыть();

EndFunction

Function JSONToStructure(JSON, DateFields="")

    JSONReader = New JSONReader;
    JSONReader.SetString(JSON);

    Try
        QueryStructure = ReadJSON(JSONReader,,DateFields);
    Except
        Raise "H002";  // Invalid JSON Format
    EndTry;

    Return QueryStructure;

EndFunction

#КонецОбласти


#Область Авторизация

Функция ПолучитьТокенАвторизации() Экспорт

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Запрос = Новый HTTPЗапрос("nidp/oauth/nam/token", Заголовки);
	Запрос.УстановитьТелоИзСтроки(
		"grant_type=password&scope=vectury+role-dms"
		+ "&client_id="     + СокрЛП(Константы.DMS_DataMart_ClientID.Получить())
		+ "&client_secret=" + СокрЛП(Константы.DMS_DataMart_ClientSecret.Получить())
		+ "&username=" + СокрЛП(Константы.DMS_DataMart_IPN.Получить())
		+ "&password=" + СокрЛП(Константы.DMS_DataMart_Password.Получить()));

	Соединение = Новый HTTPСоединение("idp.renault.com", , , , , 60, Новый OpenSSLSecureConnection());

	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат "";
	КонецЕсли;
	
	СтруктураОтвета = JSONToStructure(Ответ.ПолучитьТелоКакСтроку());
	
	Возврат СтруктураОтвета.access_token;

КонецФункции

Функция ПолучитьЗаголовкиПоУмолчанию()

	Токен = ПолучитьТокенАвторизации();

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Token", Токен);
	Заголовки.Вставить("IPN",   Константы.DMS_DataMart_IPN.Получить());

	Возврат Заголовки;

КонецФункции

Функция ПолучитьСоединениеСDMS()

	Соединение = Новый HTTPСоединение("dms.rnlt.ru",, "orders_api", "orders_api",, 60, Новый OpenSSLSecureConnection());
	
	Возврат Соединение;

КонецФункции

#КонецОбласти


#Область СписокЗаказов

Функция ПолучитьСписокЗаказов(ДилерскийЦентр, ДатаНачала, ДатаОкончания) Экспорт

	Соединение = ПолучитьСоединениеСDMS();
	
	Заголовки = ПолучитьЗаголовкиПоУмолчанию();
	
	Адрес = "/conso/hs/sp_orders/order_list";
	Адрес = Адрес + "?" + "lmt=" + ДилерскийЦентр.Бир_ЛМТ;
	Адрес = Адрес + "&" + "from=" + Формат(ДатаНачала, "ДФ=yyyy-MM-dd");
	Адрес = Адрес + "&" + "to=" + Формат(ДатаОкончания, "ДФ=yyyy-MM-dd");

	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);

	Ответ = Соединение.Получить(Запрос);

	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

	Если Ответ.КодСостояния = 200 Тогда
		Возврат JSONToStructure(ТелоОтвета, "date,last_modified");
	Иначе
		Возврат ТелоОтвета;
	КонецЕсли;

КонецФункции

Функция ОбновитьЗаказы(ДилерскийЦентр, ДатаНачала, ДатаОкончания) Экспорт

	СписокЗаказов = ПолучитьСписокЗаказов(ДилерскийЦентр, ДатаНачала, ДатаОкончания);
	
	Если ТипЗнч(СписокЗаказов) = Тип("Структура") Тогда  // Все хорошо, сохраняем
		
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20)));
		Таблица.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		Таблица.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
		Таблица.Колонки.Добавить("ДатаМодификации", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
		Для Каждого order Из СписокЗаказов.orders Цикл
			
			Стр = Таблица.Добавить();
			Стр.Дата = order.date;
			Стр.Номер = order.number;
			Стр.Статус = order.status;
			Стр.ДатаМодификации = order.last_modified;
			
		КонецЦикла;
		
		// Сравниваем с текущими данными
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Дата КАК Дата,
		               |	Таблица.Номер КАК Номер,
		               |	Таблица.Статус КАК Статус,
		               |	Таблица.ДатаМодификации КАК ДатаМодификации
		               |ПОМЕСТИТЬ ВТ_Статусы
		               |ИЗ
		               |	&Таблица КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Renault_ДопРеквизитыЗаказаПоставщику.ЗаказПоставщику КАК ЗаказПоставщику,
		               |	Renault_ДопРеквизитыЗаказаПоставщику.ДатаЗаказаРено КАК ДатаЗаказаРено,
		               |	Renault_ДопРеквизитыЗаказаПоставщику.НомерЗаказаРено КАК НомерЗаказаРено,
		               |	Renault_ДопРеквизитыЗаказаПоставщику.ДатаОбновления КАК ДатаОбновления,
		               |	ВТ_Статусы.Номер КАК Номер,
		               |	ВТ_Статусы.Дата КАК Дата,
		               |	ВТ_Статусы.Статус КАК Статус,
		               |	ВТ_Статусы.ДатаМодификации КАК ДатаМодификации
		               |ИЗ
		               |	РегистрСведений.Renault_ДопРеквизитыЗаказаПоставщику КАК Renault_ДопРеквизитыЗаказаПоставщику
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Статусы КАК ВТ_Статусы
		               |		ПО Renault_ДопРеквизитыЗаказаПоставщику.ДатаЗаказаРено = ВТ_Статусы.Дата
		               |			И Renault_ДопРеквизитыЗаказаПоставщику.НомерЗаказаРено = ВТ_Статусы.Номер
					   |			И Renault_ДопРеквизитыЗаказаПоставщику.ДатаОбновления < ВТ_Статусы.ДатаМодификации";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбновитьЗаказ(Выборка.ЗаказПоставщику);
			
		КонецЦикла;
		
	Иначе  // Получена ошибка

		Сообщить(СписокЗаказов);

	КонецЕсли;

КонецФункции

#КонецОбласти


#Область Заказ

Функция ОтправитьЗаказВDMS(СтруктураЗаказа)
	
	Соединение = ПолучитьСоединениеСDMS();
	
	Заголовки = ПолучитьЗаголовкиПоУмолчанию();

	Запрос = Новый HTTPЗапрос("/conso/hs/sp_orders/order", Заголовки);
	Запрос.УстановитьТелоИзСтроки(StructureToJSON(СтруктураЗаказа));
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

	Если Ответ.КодСостояния = 200 Тогда
		Возврат JSONToStructure(ТелоОтвета, "date");
	Иначе
		Возврат ТелоОтвета;
	КонецЕсли;

КонецФункции

Функция ВыгрузитьЗаказ(ЗаказСсылка) Экспорт
	
	СтруктураЗаказа = СформироватьСтруктуруЗаказаДляОтправки(ЗаказСсылка);
	
	РезультатОтправки = ОтправитьЗаказВDMS(СтруктураЗаказа);
	
	Если ТипЗнч(РезультатОтправки) = Тип("Структура") Тогда  // Все хорошо, сохраняем
		
		Менеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
		Менеджер.ЗаказПоставщику = ЗаказСсылка;
		Менеджер.Прочитать();
		
		Менеджер.НомерЗаказаРено = РезультатОтправки.number;
		Менеджер.ДатаЗаказаРено  = РезультатОтправки.date;
		Менеджер.СтатусЗаказа    = "Отправлен";
		Менеджер.ДатаОбновления  = ТекущаяДата();
		
		Менеджер.Записать();
		
	КонецЕсли;
	
	Возврат РезультатОтправки;

КонецФункции

Функция ПолучитьЗаказ(ДилерскийЦентр, НомерЗаказа, ДатаЗаказа) Экспорт
	
	Соединение = ПолучитьСоединениеСDMS();
	
	Заголовки = ПолучитьЗаголовкиПоУмолчанию();
	
	Адрес = "/conso/hs/sp_orders/order";
	Адрес = Адрес + "?" + "lmt=" + ДилерскийЦентр.Бир_ЛМТ;
	Адрес = Адрес + "&" + "order=" + НомерЗаказа;
	Адрес = Адрес + "&" + "date=" + Формат(ДатаЗаказа, "ДФ=yyyy-MM-dd");

	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	
	Ответ = Соединение.Получить(Запрос);
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

	Если Ответ.КодСостояния = 200 Тогда
		Возврат JSONToStructure(ТелоОтвета);
	Иначе
		Возврат ТелоОтвета;
	КонецЕсли;

		
КонецФункции

Функция УдалитьЗаказ(НомерЗаказа, ДатаЗаказа) Экспорт

	Соединение = ПолучитьСоединениеСDMS();
	
	Заголовки = ПолучитьЗаголовкиПоУмолчанию();
	
	Адрес = "/conso/hs/sp_orders/order";
	Адрес = Адрес + "?" + "lmt=" + "64306100";
	Адрес = Адрес + "&" + "order=" + НомерЗаказа;
	Адрес = Адрес + "&" + "date=" + Формат(ДатаЗаказа, "ДФ=yyyy-MM-dd");

	
	Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
	
	Ответ = Соединение.Удалить(Запрос);
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

	Если Ответ.КодСостояния = 200 Тогда
		Возврат JSONToStructure(ТелоОтвета);
	Иначе
		Возврат ТелоОтвета;
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьЗаказ(ЗаказСсылка)
	
	Отбор = Новый Структура("ЗаказПоставщику", ЗаказСсылка);
	ДопРеквизиты = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.Получить(Отбор);
	
	ЗаказССервера = ПолучитьЗаказ(ДопРеквизиты.ДилерскийЦентр,
	                              ДопРеквизиты.НомерЗаказаРено,
								  ДопРеквизиты.ДатаЗаказаРено);
								  
	Если ТипЗнч(ЗаказССервера) = Тип("Структура") Тогда
		
		Менеджер = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.СоздатьМенеджерЗаписи();
		Менеджер.ЗаказПоставщику = ЗаказСсылка;
		Менеджер.Прочитать();
		
		Менеджер.СтатусЗаказа = ЗаказССервера.status;
		Менеджер.ДатаОбновления = ТекущаяДата();
		
		
		
    Иначе КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Остатки

Функция ПолучитьОстаткиПоЗаказу(ЗаказСсылка) Экспорт
	
	Отбор = Новый Структура("ЗаказПоставщику", ЗаказСсылка);
	ДопРеквизиты = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.Получить(Отбор);

	СписокАртикулов = Новый Массив;
	
	Для Каждого Стр Из ЗаказСсылка.Товары Цикл
		СписокАртикулов.Добавить(Стр.Номенклатура.Артикул);
	КонецЦикла;
	
	Остатки = ПолучитьОстатки(ДопРеквизиты.ДилерскийЦентр, СписокАртикулов);
	
	Возврат Остатки;
	
КонецФункции

Функция ПолучитьОстатки(ДилерскийЦентр, СписокАртикулов, Режим="central")
	
	Соединение = ПолучитьСоединениеСDMS();
	
	Заголовки = ПолучитьЗаголовкиПоУмолчанию();
	
	Остатки = Новый Массив();
	
	Для Каждого Артикул Из СписокАртикулов Цикл 
	
		Адрес = "/conso/hs/sp_orders/stocks";
		Адрес = Адрес + "?" + "lmt=" + ДилерскийЦентр.Бир_ЛМТ;
		Адрес = Адрес + "&" + "stock=" + Режим;
		Адрес = Адрес + "&" + "reference=" + Артикул;
		
		
		Запрос = Новый HTTPЗапрос(Адрес, Заголовки);
		
		Ответ = Соединение.Получить(Запрос);
		
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

		Если Ответ.КодСостояния = 200 Тогда
			Остатки.Добавить(Новый Структура("reference,stocks", Артикул, JSONToStructure(ТелоОтвета)));
		КонецЕсли;
		
	КонецЦикла;

	Возврат Остатки;

КонецФункции

#КонецОбласти


#Область Преопределяемые

Функция СформироватьСтруктуруЗаказаДляОтправки(ЗаказСсылка)

	Отбор = Новый Структура("ЗаказПоставщику", ЗаказСсылка);
	ДопРеквизиты = РегистрыСведений.Renault_ДопРеквизитыЗаказаПоставщику.Получить(Отбор);

	СтруктураЗаказа = Новый Структура;
	
	СтруктураЗаказа.Вставить("date", Формат(ЗаказСсылка.Дата, "ДФ=yyyy-MM-dd"));
	СтруктураЗаказа.Вставить("number", ЗаказСсылка.Номер);
	СтруктураЗаказа.Вставить("lmt", ДопРеквизиты.ДилерскийЦентр.Бир_ЛМТ);
    СтруктураЗаказа.Вставить("site", ДопРеквизиты.SITE);
    СтруктураЗаказа.Вставить("order_type", Лев(ДопРеквизиты.ТипЗаказа, 4));
    СтруктураЗаказа.Вставить("promo", "");
    СтруктураЗаказа.Вставить("repairOrder", ДопРеквизиты.НомерЗаказНаряда);
    СтруктураЗаказа.Вставить("VIN", ДопРеквизиты.Автомобиль.VIN);
    СтруктураЗаказа.Вставить("spareCarVIN", ДопРеквизиты.ПодменныйАвтомобиль.Автомобиль.VIN);
    СтруктураЗаказа.Вставить("spareCarDate", ДопРеквизиты.ДатаВыдачиПодменногоАвтомобиля);

	Товары = Новый Массив;
	Для Каждого Стр Из ЗаказСсылка.Товары Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("reference", Стр.Номенклатура.Артикул);
		СтруктураСтроки.Вставить("qty", Стр.Количество);
		Товары.Добавить(СтруктураСтроки);
	КонецЦикла;
	СтруктураЗаказа.Вставить("lines", Товары);
	
	Возврат СтруктураЗаказа;
	
КонецФункции

#КонецОбласти
